OpenFOAM-6-cantera/tutorials/lagrangian/reactingParcelFoam/rivuletPanel/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel kinematicSingleLayer;

regionName      wallFilmRegion;

active          true;

kinematicSingleLayerCoeffs
{
    filmThermoModel constant;
    constantCoeffs
    {
        specie      water;
        rho0        1000;
        mu0         1e-3;
        sigma0      0.07;
    }

    injectionModels ();

    turbulence      laminar;
    laminarCoeffs
    {
        Cf          0.001;
    }

    forces
    (
        thermocapillary
        distributionContactAngle
    );

    distributionContactAngleCoeffs
    {
        Ccf             1;

        distribution
        {
            type            normal;
            normalDistribution
            {
                minValue        50;
                maxValue        100;
                expectation     75;
                variance        100;
            }
        }

        zeroForcePatches ();
    }
}


// ************************************************************************* //
